---
kind: method
id: M:Autodesk.Revit.DB.BaseExportOptions.SetExportFontTable(Autodesk.Revit.DB.ExportFontTable)
source: html/86d6662a-fc5b-0027-2167-0f1f70efc923.htm
---
# Autodesk.Revit.DB.BaseExportOptions.SetExportFontTable Method

Sets font table to option.

## Syntax (C#)
```csharp
public void SetExportFontTable(
	ExportFontTable fontTable
)
```

## Parameters
- **fontTable** (`Autodesk.Revit.DB.ExportFontTable`) - The font table to be set.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null